Revit 2026 API

# UVAngleTo Method

---

Returns the angle between this vector and the specified vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double AngleTo(
	UV source
)
```
```vb
Public Function AngleTo (
	source As UV
) As Double
```
```cpp
public:
double AngleTo(
	UV^ source
)
```
```fsharp
member AngleTo :
        source : UV -> float
```

#### Parameters

source UV
    The specified vector.

#### Return Value

DoubleThe real number between 0 and 2*PI equal to the angle between the two vectors in radians.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when source is . |

The angle is measured counterclockwise.

#### Reference

UV Class

Autodesk.Revit.DB Namespace